<?php

return [
    'collar' => [
        1 => 'คอปก',
        2 => 'คอจีน',
        3 => 'ปกเชิ้ต'
    ],
    'collar_type' => [
        1 => 'ปกธรรมดา',
        2 => 'ปกทอ/ขลิบปก',
        3 => 'ปกเจ็กการ์ด',
        4 => 'ปกเชิ้ต',
        0 => 'อื่นๆ'
    ],
    'button' => [
        1 => '2 เม็ด',
        2 => '3 เม็ด',
        0 => 'อื่นๆ'
    ],
    'placket' => [
        1 => 'สาปปกติ',
        2 => 'สาปโชว์',
        3 => 'สาปแลป',
        0 => 'อื่นๆ'
    ],
    'sleeve' => [
        1 => 'แขนปล่อย',
        2 => 'แขนซ้อน/แขนเบิล',
        3 => 'แขนจั๊มรอบ',
        4 => 'แขนจั๊มครึ่ง'
    ],
    'pocket' => [
        1 => 'กระเป๋าโชว์',
        2 => 'กระเป๋าเจาะ',
        3 => 'ไม่มีกระเป๋า',
    ],
    'embroider_position' => [
        1 => 'ปักบนกระเป๋า',
        2 => 'ปักเหนือกระเป๋า',
        3 => 'ปักอกซ้าย',
        4 => 'ปักอกขวา',
        5 => 'ปักแขนซ้าย',
        6 => 'ปักแขนขวา',
        7 => 'ปักหลัง',
    ],
    'width' => [
        'รายละเอียดปกคอ' => 35,
        'ชื่อสาป' => 18,
        'สาปนอก' => 21,
        'สาปใน' => 17,
        'รายละเอียดกระดุม' => 35,
        'สีกระดุม' => 19,
        'รูปแบบแขน' => 23,
        'รายละเอียดแขน' => 31,
        'รูปแบบกระเป๋า' => 28,
        'รายละเอียดกระเป๋า' => 36,
        'ชายซ้อน / ชายเบิล' => 39,
        'วงพระจันทร์' => 27,
        'ผ่าข้าง' => 17,
    ],
];
