<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\MasterBusinessType;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Str;

class BusinessTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // Clear existing data
        DB::table('master_business_types')->truncate();

        $businessTypes = [
            'เครื่องปรุง', 'ผลิตอะไหล่เครื่องยนต์', 'โรงผลิตเครื่องสำอาง', 'แบรนด์เครื่องสำอาง',
            'ประกัน', 'โรงแรม', 'อุปกรณ์โรงงานไอที', 'แบรนด์สินค้าขายไอที', 'บริษัทออแกไนท์',
            'โลจิสติก', 'แบรนด์น้ำมันเครื่อง', 'โรงเรียน', 'เกษตร', 'ธนาคาร', 'โทรศัพท์',
            'หน่วยงานรัฐบาล', 'ก่อสร้าง', 'แบรนด์หมู่บ้าน', 'ห้าง', 'ขนม', 'ผลิตภัณฑ์ดูแลตัวเอง',
            'ผลิตภัณฑ์ดูแลบ้าน', 'ผลิตภัณฑ์เครื่องใช้ไฟฟ้า', 'บริษัทนำเข้า', 'บริษัทยางรถยนต์',
            'เครื่องช่าง', 'น้ำผลไม้', 'เครื่องแอลกอ', 'โรงงานยาสูบ', 'สำนักข่าว-สื่อโทรทัศน์',
            'แบรนด์ข้าว', 'คริปโต', 'บริษัทสินเชื่อ', 'บริษัทจัดหางาน', 'บริษัททำความสะอาด',
            'สโมสรฟุตบอล', 'งานวิ่ง', 'เฟอร์นิเจอร์', 'บรรจุภัณ', 'นม', 'เครื่องเขียน',
            'ยากันยุง-ยาฆ่าแมลง', 'ปูน', 'สีทาบ้าน-สีสเปย์', 'ชา-กาแฟ', 'เครื่องกรองน้ำ',
            'แบรนด์วุ้นเส้น', 'อาหารสำเร็จรูป', 'มหาลัย', 'โรงพยาบาล', 'managment',
            'พระเครื่อง', 'บริษัท softwere-Mkt-web', 'สำนักงานกฏหมาย-บัญชี', 'โรงเรียนสอนภาษา',
            'ร้านเหล้า', 'Logistics', 'สมาคม', 'โครงการต่างประเทศ', 'ปั้มน้ำมัน', 'ช่องยูทูป',
            'แบรนด์เสื้อ', 'ส่งเคมีภัณฑ์', 'เคมี', 'สารเคมี', 'อุตสาหกรรม', 'แบรนด์รองเท้า',
            'ศาสนา', 'อสังหาริมทรัพย์', 'อาหารสัตว์'
        ];

        $sort = 1;
        foreach ($businessTypes as $type) {
            MasterBusinessType::create([
                'bt_name' => $type,
                'bt_sort' => $sort++,
                'bt_is_use' => true,
            ]);
        }
    }
}
